tutorials/impinging_jet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dab           Dab [0 2 -1 0 0 0 0]     1.7e-09;
alphatab      alphatab [0 0 0 0 0 0 0] 1;

Tref		Tref [ 0 0 0 1 0 0 0] 305.15;

phases (methanol water);

methanol
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 6.87e-07;
    rho             rho [1 -3 0 0 0 0 0] 782.0;
    Cp		    Cp [ 0 2 -2 -1 0 0 0 ] 2504.22; 
    k		    k [ 1 1 -3 -1 0 0 0 ] 0.203;
    Tref	    Tref [ 0 0 0 1 0 0 0] 305.15;
}

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 8.976e-07;
    rho             rho [1 -3 0 0 0 0 0] 997.1;
    Cp		    Cp [ 0 2 -2 -1 0 0 0 ] 4183.00;
    k		    k [ 1 1 -3 -1 0 0 0 ] 0.6;
    Tref	    Tref [ 0 0 0 1 0 0 0] 305.15;
}

// ************************************************************************* //
